package java.lang;

class CharacterData00 extends CharacterData {
   static final CharacterData00 instance = new CharacterData00();
   static final char[][][] charMap = new char[][][]{{{'ß'}, {'S', 'S'}}, {{'İ'}, {'İ'}}, {{'ŉ'}, {'ʼ', 'N'}}, {{'ǰ'}, {'J', '̌'}}, {{'ΐ'}, {'Ι', '̈', '́'}}, {{'ΰ'}, {'Υ', '̈', '́'}}, {{'և'}, {'Ե', 'Ւ'}}, {{'ẖ'}, {'H', '̱'}}, {{'ẗ'}, {'T', '̈'}}, {{'ẘ'}, {'W', '̊'}}, {{'ẙ'}, {'Y', '̊'}}, {{'ẚ'}, {'A', 'ʾ'}}, {{'ὐ'}, {'Υ', '̓'}}, {{'ὒ'}, {'Υ', '̓', '̀'}}, {{'ὔ'}, {'Υ', '̓', '́'}}, {{'ὖ'}, {'Υ', '̓', '͂'}}, {{'ᾀ'}, {'Ἀ', 'Ι'}}, {{'ᾁ'}, {'Ἁ', 'Ι'}}, {{'ᾂ'}, {'Ἂ', 'Ι'}}, {{'ᾃ'}, {'Ἃ', 'Ι'}}, {{'ᾄ'}, {'Ἄ', 'Ι'}}, {{'ᾅ'}, {'Ἅ', 'Ι'}}, {{'ᾆ'}, {'Ἆ', 'Ι'}}, {{'ᾇ'}, {'Ἇ', 'Ι'}}, {{'ᾈ'}, {'Ἀ', 'Ι'}}, {{'ᾉ'}, {'Ἁ', 'Ι'}}, {{'ᾊ'}, {'Ἂ', 'Ι'}}, {{'ᾋ'}, {'Ἃ', 'Ι'}}, {{'ᾌ'}, {'Ἄ', 'Ι'}}, {{'ᾍ'}, {'Ἅ', 'Ι'}}, {{'ᾎ'}, {'Ἆ', 'Ι'}}, {{'ᾏ'}, {'Ἇ', 'Ι'}}, {{'ᾐ'}, {'Ἠ', 'Ι'}}, {{'ᾑ'}, {'Ἡ', 'Ι'}}, {{'ᾒ'}, {'Ἢ', 'Ι'}}, {{'ᾓ'}, {'Ἣ', 'Ι'}}, {{'ᾔ'}, {'Ἤ', 'Ι'}}, {{'ᾕ'}, {'Ἥ', 'Ι'}}, {{'ᾖ'}, {'Ἦ', 'Ι'}}, {{'ᾗ'}, {'Ἧ', 'Ι'}}, {{'ᾘ'}, {'Ἠ', 'Ι'}}, {{'ᾙ'}, {'Ἡ', 'Ι'}}, {{'ᾚ'}, {'Ἢ', 'Ι'}}, {{'ᾛ'}, {'Ἣ', 'Ι'}}, {{'ᾜ'}, {'Ἤ', 'Ι'}}, {{'ᾝ'}, {'Ἥ', 'Ι'}}, {{'ᾞ'}, {'Ἦ', 'Ι'}}, {{'ᾟ'}, {'Ἧ', 'Ι'}}, {{'ᾠ'}, {'Ὠ', 'Ι'}}, {{'ᾡ'}, {'Ὡ', 'Ι'}}, {{'ᾢ'}, {'Ὢ', 'Ι'}}, {{'ᾣ'}, {'Ὣ', 'Ι'}}, {{'ᾤ'}, {'Ὤ', 'Ι'}}, {{'ᾥ'}, {'Ὥ', 'Ι'}}, {{'ᾦ'}, {'Ὦ', 'Ι'}}, {{'ᾧ'}, {'Ὧ', 'Ι'}}, {{'ᾨ'}, {'Ὠ', 'Ι'}}, {{'ᾩ'}, {'Ὡ', 'Ι'}}, {{'ᾪ'}, {'Ὢ', 'Ι'}}, {{'ᾫ'}, {'Ὣ', 'Ι'}}, {{'ᾬ'}, {'Ὤ', 'Ι'}}, {{'ᾭ'}, {'Ὥ', 'Ι'}}, {{'ᾮ'}, {'Ὦ', 'Ι'}}, {{'ᾯ'}, {'Ὧ', 'Ι'}}, {{'ᾲ'}, {'Ὰ', 'Ι'}}, {{'ᾳ'}, {'Α', 'Ι'}}, {{'ᾴ'}, {'Ά', 'Ι'}}, {{'ᾶ'}, {'Α', '͂'}}, {{'ᾷ'}, {'Α', '͂', 'Ι'}}, {{'ᾼ'}, {'Α', 'Ι'}}, {{'ῂ'}, {'Ὴ', 'Ι'}}, {{'ῃ'}, {'Η', 'Ι'}}, {{'ῄ'}, {'Ή', 'Ι'}}, {{'ῆ'}, {'Η', '͂'}}, {{'ῇ'}, {'Η', '͂', 'Ι'}}, {{'ῌ'}, {'Η', 'Ι'}}, {{'ῒ'}, {'Ι', '̈', '̀'}}, {{'ΐ'}, {'Ι', '̈', '́'}}, {{'ῖ'}, {'Ι', '͂'}}, {{'ῗ'}, {'Ι', '̈', '͂'}}, {{'ῢ'}, {'Υ', '̈', '̀'}}, {{'ΰ'}, {'Υ', '̈', '́'}}, {{'ῤ'}, {'Ρ', '̓'}}, {{'ῦ'}, {'Υ', '͂'}}, {{'ῧ'}, {'Υ', '̈', '͂'}}, {{'ῲ'}, {'Ὼ', 'Ι'}}, {{'ῳ'}, {'Ω', 'Ι'}}, {{'ῴ'}, {'Ώ', 'Ι'}}, {{'ῶ'}, {'Ω', '͂'}}, {{'ῷ'}, {'Ω', '͂', 'Ι'}}, {{'ῼ'}, {'Ω', 'Ι'}}, {{'ﬀ'}, {'F', 'F'}}, {{'ﬁ'}, {'F', 'I'}}, {{'ﬂ'}, {'F', 'L'}}, {{'ﬃ'}, {'F', 'F', 'I'}}, {{'ﬄ'}, {'F', 'F', 'L'}}, {{'ﬅ'}, {'S', 'T'}}, {{'ﬆ'}, {'S', 'T'}}, {{'ﬓ'}, {'Մ', 'Ն'}}, {{'ﬔ'}, {'Մ', 'Ե'}}, {{'ﬕ'}, {'Մ', 'Ի'}}, {{'ﬖ'}, {'Վ', 'Ն'}}, {{'ﬗ'}, {'Մ', 'Խ'}}};
   static final char[] X = "\u0000\u0010 0@P`p\u0080\u0090 °ÀÐàð\u0080ĀĐĠİŀŐŠŰŰƀƐƠưǀǐǠǰȀ\u0080Ȑ\u0080Ƞ\u0080\u0080Ȱɀɐɠɰʀʐʠʰˀːʰʰˠ˰̠̀̐ʰʰ̰̀͐͠Ͱ\u0380ΐΐΠΐΰπϐϠϰЀАРарѐѠѰҀҐҠҰЀӀӐӠӰԀԐԠ\u0530ՀՐ\u0560հր\u0590֠հְ׀אנװ\u0600ؐؠذـΐِ٠ٰΐڀڐڠڰۀې۠ΐ۰܀ܐܠܰ݀ݐݠ۰۰۰۰۰۰۰۰۰۰ݰ۰ހސޠ۰ް۰߀ߐߠ۰۰߰ࠀ۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰ࠐࠠ۰۰࠰ࡀࡐ\u0860\u0870۰\u0880\u0890ࢠ\u08b0۰\u08c0\u08d0۰\u08e0۰ࣰऀऐठर۰ीॐॠ॰۰\u0980ঐঠরΐΐী\u09d0ৠৰ\u0a00ਐ۰ਠ۰ਰੀ\u0a50ΐΐ\u0a60ੰ\u0a80ઐઠરીઠŰૐ\u0080\u0080\u0080\u0080ૠ\u0080\u0080\u0080૰\u0b00ଐଠରୀ\u0b50ୠ୰\u0b80ஐ\u0ba0ரீௐ\u0be0௰\u0c00ఐఠరీ\u0c50ౠ\u0c70\u0c80ಐಠರೀ\u0cd0ೠ\u0cf0\u0d00ഐഠരീ\u0d50ൠॠ൰\u0d80ඐචධවැॠॠॠॠॠ\u0de0\u0df0\u0e00ॠॠॠฐॠภॠॠะॠॠเ๐ॠ\u0e60\u0e70ഐഐഐഐഐഐഐഐ\u0e80\u0e80\u0e80\u0e80\u0e90\u0ea0ະເ໐\u0ee0\u0ef0ༀ༐༠༰ཀॠཐའΐΐΐΐΐ\u0f70ྀྐྠ\u0080\u0080\u0080ྰ࿀࿐۰\u0fe0\u0ff0ကကတဠူΐΐ၀ॠॠၐॠॠॠॠॠॠၠၰႀ႐ؠ۰Ⴀࠀ۰ႰჀა۰۰რჰॠᄀᄐᄠᄰᅀᄠᅐᅠᅰഐഐഐᆀഐഐᆐᆠᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᇀॠॠᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᆰᇐΐᇠ۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰ᇰॠሀ\u0a50۰۰۰۰۰۰۰۰ሐሠ\u0080ሰቀ۰۰ቐበተ\u0080ኀነአΐኰዀዐ۰ዠደጀጐጠጰፀፐऀπ፠፰ΐ۰ᎀ᎐Ꭰ۰ᎰᏀᏐᏠᏰΐΐΐΐ۰᐀۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰۰ᐐᐠᐰᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑀᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᑐᆰᆰᆰᑠᆰᑰᒀᒐᆰᆰᆰᒠᆰᆰᒰΐᓀᓐᓠʰʰᓰᔀʰʰʰʰʰʰʰʰʰʰᔐᔠʰᔰʰᕀᕐᕠᕰᖀᖐʰʰʰᖠᖰ ᗀᗐᗠᗰᘀᘐ".toCharArray();
   static final char[] Y = "\u0000\u0000\u0000\u0000\u0002\u0004\u0006\u0000\u0000\u0000\u0000\u0000\u0000\u0000\b\u0004\n\f\u000e\u0010\u0012\u0014\u0016\u0018\u001a\u001a\u001a\u001a\u001a\u001c\u001e \"$$$$$$$$$$$$&(*,............024\u0000\u00006\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00008::<>@BDFHJ\u0010LNPRTTTTTTTTTTTVTTTXZZZZZZZZZZZ\\ZZZ^````````````````````````b```dfffffffh```````````````````````jffhl``nprtvxpz|`~\u0080\u0082```\u0084\u0086\u0088`\u0084\u008a\u008cf\u008e`\u0090`\u0092\u0094\u0094\u0096\u0098\u009a\u0096\u009cfffffff\u009e````````` \u009a`¢````¤`````````\u0088\u0088\u0088¦¨ª¬®°`````²´¶¸º¼\u0088\u0088¾ÀÂÄÆÂ\u0088ÈÂÊÌ\u0088\u0088\u0088Â\u0088ÎÐ\u0088\u0088ÒÔÖ\u0088\u0088ØÚ\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088ÜÜÜÜÞàââÜääæææææâäääääääÜÜèäääêìääääääääîîîîîîîîîîîîîîîîîîðîîîîîîîîîîîîîîîîîîîîî``ê`òôöøòòäúüþĀĂĄTTTTTTTTĆTTTTĈĊČZZZZZZZZĎZZZZĐĒĔĖĘĚ````````````ĜĞĠĢĤ`ĦĨĪĪĪĪĪĪĪĪTTTTTTTTTTTTTTTTZZZZZZZZZZZZZZZZĬĬĬĬĬĬĬĬ`Įîîİ```````````ĲffffffĴ````````````òòòòĶĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĺļľľľŀłłłłłłłłłłłłłłłłłłńņňòŊŌîîîîîîîîîîîîîîîŎŎŎŎŎŎŎŐŒŔŎŒòòòòŖŖŖŖŖŖŖŖŖŖŖŖŖŘòòŖŚŜòòòòòŞŞŠŢŤŦŨŪŎŎŎŎŎŬòŮŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŲŰŰŰŰŴŎŎŎŎŎŎŶŎŎŎŸŸŸŸŸźżŰžŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰƀŎŎŎƂƄŶŎƆƈƊîŶŰ\u001a\u001a\u001a\u001a\u001aŰƌƎŮŮŮŮŮŮŮƐŴŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŎŎŎŎŎŎŎŎîîîîîƒƔŰŰŰŰŰŰŰŰŰŰŰŰŎŎŎŎŎžòòòòòòòƖƖƖƖƖŖŖŖŖŖŖŖŖŖŖŖŖŖŖŖŖƘîîîîƚ<\u0010ƜòòŖŖŖŖŖŖŖŖŖŖŖŎîƞŎŎŎŎƞŎƞŎƠòƢƢƢƢƢƢƢŜŖŖŖŖŖŖŖŖŖŖŖŖƘîòŜòòòòòòòòòòòòòòòòƤŰŰŰŰŰƤòòòòòòòòòòòŎŎŎîîîŎŎŎŎŎŎŎƦŎƨ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƨƪƬƮŎŎŎƨƬưƬƲîŶŎ\u0094\u0094\u0094\u0094\u0094Ŏľƴƴƴƴƴƶ\u0094\u0094\u0094Ƹ\u0094\u0094\u0094ƺƬƸ\u0094\u0094\u0094ƼƸƼƸ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽ\u0094\u0094\u0094ƼƼò\u0094\u0094òƪƬƮŎƦƾǀƾưƼòòòƾòò\u0094Ƹ\u0094Ŏòƴƴƴƴƴ\u0094:ǂǂǄǆòòƺƨƸ\u0094\u0094ƼòƸƼƸ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽ\u0094\u0094\u0094Ƽ\u0094ƸƼ\u0094òƒƬƮƦòƺƦƺƠòƺòòòƸ\u0094ƼƼòòòƴƴƴƴƴŎ\u0094ǈòòòòòƺƨƸ\u0094\u0094\u0094\u0094Ƹ\u0094Ƹ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽ\u0094\u0094\u0094Ƽ\u0094Ƹ\u0094\u0094òƪƬƮŎŎƺƨƾưòƼòòòòòòò\u0094ŎòƴƴƴƴƴǊòòòòòòò\u0094\u0094\u0094\u0094Ƽ\u0094\u0094\u0094Ƽ\u0094Ƹ\u0094\u0094òƪƮƮŎƦƾǀƾưòòòòƨòò\u0094Ƹ\u0094ŎòƴƴƴƴƴǌǂǂǂòòòòòǎƸ\u0094\u0094Ƽò\u0094Ƽ\u0094\u0094òƸƼƼ\u0094òƸƼò\u0094Ƽò\u0094\u0094\u0094\u0094\u0094\u0094òòƬƨǀòƬǀƬưòƼòòƾòòòòòòòƴƴƴƴƴǐǒŪŪǔǖòòƾƬƸ\u0094\u0094\u0094Ƽ\u0094Ƽ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽ\u0094\u0094\u0094\u0094\u0094Ƹ\u0094\u0094òƸŎƨƬǀŎƦŎƠòòòƺƦ\u0094òòò\u0094ŎòƴƴƴƴƴòòòòǘǘǚǜòƬƸ\u0094\u0094\u0094Ƽ\u0094Ƽ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽ\u0094\u0094\u0094\u0094\u0094Ƹ\u0094\u0094òƪǞƬƬǀǠǀƬƠòòòƾǀòòòƼ\u0094ŎòƴƴƴƴƴƸƼòòòòòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƼƸƬƮŎƦƬǀƬưƼòòòƾòòòò\u0094ŎòƴƴƴƴƴǐǂǂòǢ\u0094\u0094\u0094òƬƸ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƹ\u0094\u0094\u0094\u0094Ƹò\u0094\u0094\u0094ƼòƒòƾƬŎƦƦƬƬƬƬòòòòòòòòòƬǤòòòòòƸ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ǈ\u0094ŎŎŎƦòŊ\u0094\u0094\u0094ǦîîŶǨǪǪǪǪǪľòòƸƼƼƸƼƼƸòòò\u0094\u0094Ƹ\u0094\u0094\u0094Ƹ\u0094ƸƸò\u0094Ƹ\u0094ǈ\u0094ŎŎŎƺǎò\u0094\u0094ƼǬîîŶòǪǪǪǪǪò\u0094\u0094ǮǰľľľľľľľǲǲǰîǰǰǰǴǴǴǴǴǂǂǂǂǂĮĮĮ\u0012\u0012Ƕ\u0094\u0094\u0094\u0094Ƹ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƼòƺŎŎŎŎŎŎƨŎîǨî\u0094\u0094ǈŎŎŎŎŎƺŎŎŎŎŎŎŎŎŎŎŎŎŎŎŎŎŎƦǰǰǰǰǸǰǰǺǰľľǲǰǼǤòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ǾƮŎƨŎŎƠưȀƮǎǴǴǴǴǴľľľ\u0094\u0094\u0094ƬŎ\u0094\u0094ŎǎȂȄǾȂǶǶ\u0094ǈŎǎ\u0094\u0094\u0094\u0094\u0094\u0094ƨƮȆǶǶȈȊǪǪǪǪǪǶƮǰȌȌȌȌȌȌȌȌȌȌȌȌȌȌȌȌȌȌȌȎòòȎò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ȐȒ\u0094\u0094\u0094\u0094\u0094Ƽ\u0094\u0094ò\u0094\u0094\u0094ƼƼ\u0094\u0094ò\u0094\u0094\u0094\u0094Ƽ\u0094\u0094ò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽ\u0094\u0094ò\u0094\u0094\u0094ƼƼ\u0094\u0094ò\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽ\u0094\u0094ò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƼŌŶľľľľȔȖȖȖȖȘȚǂǂǂȜò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ŪŪŪŪŪòòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƼòòòòòȞ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ȐȠ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ȣ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ȤȦò\u0094\u0094\u0094\u0094\u0094ȐľȨȪòòòòòòò\u0094\u0094\u0094\u0094\u0094\u0094Ƽ\u0094\u0094Ŏƒòòòòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ŎǨǤòòòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ŏòòòòòò\u0094\u0094\u0094\u0094\u0094\u0094Ƽ\u0094ƼŎòòòòòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094îƮŎŎŎƬƬƬƬƨưîîîîîľƶľǊƲòǴǴǴǴǴòòòȬȬȬȬȬòòò\u0010\u0010\u0010Ȯ\u0010ȰîȲǪǪǪǪǪòòò\u0094ȴ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094òòòò\u0094\u0094\u0094\u0094ǈƼòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094òòòòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƼòŎƨƬƮƨƬòòƬƨƬƬưîòòǖò\u0010ƴƴƴƴƴ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ò\u0094\u0094Ƽòòòòò\u0094\u0094\u0094\u0094\u0094\u0094òòƬƬƬƬƬƬƬƬȶ\u0094\u0094\u0094ƬòòòǪǪǪǪǪȸòŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ǈƨƬòľ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ǾƨŎŎŎƦȀƨƮŎŎŎƨƬƬƮƠîîîƒŌǴǴǴǴǴòòòǪǪǪǪǪòòòľľľƶľľľòòòòòòòòòŎŎȶ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ȀŎŎƨƨƬƬƨȄ\u0094\u0094\u0094òòǪǪǪǪǪľľľǲǰǰǰǰĮîîîîǰǰǰǰǺòŎȶ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ǾŎŎƬŎȈƬ\u0094ǪǪǪǪǪ\u0094\u0094\u0094\u0094\u0094\u0094ȀŎƬƮƮŎǶòòòòľľ\u0094\u0094ƬƬƬƬŎŎŎŎƬîòņľľǴǴǴǴǴòƸ\u0094ǪǪǪǪǪ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094âââľľľľľòòòòîǨîîîîîîȺîîîƪ\u0094Ʋ\u0094\u0094ƬƪƼòòòò\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜȼ\u0088\u0088\u0088\u0088\u0088\u0088Ⱦ\u0088Â\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088\u0088ɀÜÜîîîƒòòòòòòòòòòîî```````````²²ɂ\u0088ɄɆɆɆɆɈɈɈɈɆɆɆòɈɈɈòɆɆɆɆɈɈɈɈɆɆɆɆɈɈɈɈɆɆɆòɈɈɈòɊɊɊɊɌɌɌɌɆɆɆɆɈɈɈɈɎɐɐɒɔɖɘò²²²²ɚɚɚɚ²²²²ɚɚɚɚ²²²²ɚɚɚɚɆ²ɜ²Ɉɞɠɢä²ɜ²ɤɤɠäɆ²ò²ɈɦɨäɆ²ɪ²Ɉɬɮäò²ɜ²ɰɲɠɴɶɶɶɸɶɺɼɾʀʀʀ\u0010ʂʄʂʄ\u0010\u0010\u0010\u0010ʆʈʈʊʌʌʎ\u0010ʐʒ\u0010ʔʖ\u0010ʘʚ\u0010\u0010\u0010\u0010\u0010ʜʖ\u0010\u0010\u0010\u0010ʞɼɼʠòòɼɼɼʢòHHHʤʦʨʪʪʪʪʪʤʦȦÜÜÜÜÜÜʬò:::::::::::::ʮòòòòòòòòòòîîîîîîʰİʲİʲîîîîîƒòòòòòòòŪʴŪʶŪʸĖ\u0088ĖʺʶŪʼĖĖŪŪŪʴʾʴȌĖˀĖ˂\u0090\u0094ÚŪ\u0088Ė\u001eŢʼ\u0088\u0088˄ŪˆPPPPPPPPˈˈˈˈˈˈˊˊˌˌˌˌˌˌˎˎː˒˔ː˖òòòŢŢ˘ŪŪŢŪŪ˘˄Ū˘ŪŪŪ˘ŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŢŪ˘˘ŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŢŢŢŢŢŢ˚˜\u001eŢ˜˜˜Ţ˚˞˚\u001eŢ˜˜˚˜\u001e\u001e\u001eŢ˚˜˜˜˜ŢŢ˚˚˜˜˜˜˜˜˜˜\u001eŢŢ˜˜ŢŢŢŢ˚\u001e\u001e˜˜˜˜Ţ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜\u001e˚˜\u001eŢŢ\u001eŢŢŢŢ˜Ţ˜˜˜˜˜˜˜˜˜\u001eŢŢ˜ŢŢŢŢ˚˜˜Ţ˜ŢŢ˜˜˜˜˜˜˜˜˜˜˜˜Ţ˜˜˜˜˜˜˜˜ŪŪŪŪ˜˜ŪŪŪŪŪŪŪŪŪŪ˜ŪŪŪˠˢŪŪŪŪŪǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰˤ˘ŪŪŪŪŪŪŪŪŪŪŪ˦ŪŪ˄ŢŢŢŢŢŢŢŢŢŢŢŢŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŢŢŢŪŪŪŪŪŪŪŪŪòòòòòòŪŪŪǖòòòòòòòòòòòòŪŪŪŪŪǖòòòòòòòòòò˨˨˨˨˨˨˨˨˨˨˪˪˪˪˪˪˪˪˪˪ˬˬˬˬˬˬˬˬˬˬǰǰǰǰǰǰǰǰǰǰǰǰǰˮˮˮˮˮˮˮˮˮˮˮˮˮ˰˰˰˰˰˰˰˰˰˰˰˰˰˲˴˴˴˴˶˸˸˸˸˺ŪŪŪŪŪŪŪŪŪŪŪ˄ŪŪŪŪ˄ŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŢŢŢŢŪŪŪŪŪŪŪ˄ŪŪŪŪŪŪŪŪŪŪŪŪŪŪˤŪŪŪŪŪŪŪŪŪ˼ŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪŪ\u0012\u0012\u0012\u0012\u0012\u0012\u0012˾˾˾˾˾˨˨˨˨˨̀̀̀̀̀ŪŪŪŪŪŪ\u001e˚̂̄˜˚˜ŢŢ˚˜\u001eŢŢ˜\u001eŢ˜˜\u0012\u0012\u0012\u0012\u0012ŢŢŢŢŢŢŢŢŢŢŢŢŢŢŢŢŢŢŢŢŢŢŢŢŢʦ̆̆̆̆̆̆̆̆̆̆̄˚˜˜˜˜˜˜˜˜˜˜ŢŢŢŢ\u001eŢŢŢ˜˜˜Ţ˚ŢŢ˜˜\u001e˜Ţ\u0012\u0012\u001eŢ˚˚˜Ţ˜ŢŢŢŢŢ˜˜˜Ţ\u0012ŢŢŢŢŢŢ˜˜˜˜˜˜˜˜˜\u001e˜˜Ţ\u001e\u001e˚˚˜\u001eŢŢ˜ŢŢŢ˜\u001eŢŢŢŢŢŢŢŢŢŢŢ˚\u001eŢŢŢŢŢ˜ŢŢ˜˜˚\u001e˚\u001eŢ˚˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜Ţ˜˜˜˜˚˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜\u001eŢŢ\u001e\u001eŢ˜˜\u001eŢŢ˜\u001eŢ˚Ţ˚˜˜˚ŢŪŪŪŪŪŪŪŪŢŢŢŢŢŢŢŢŢŢ˘˄ŢŢ̈òŪŪŪŪŪòòòĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĸĺłłłłłłłłłłłłłłłłłłłłłłł̊`Ȍª¬ff̌ȌɄ`dt\u0088\u0088ÜȌ``̎ŪŪ̐f̒î`òò̔\u0010̖\u0010²²²²²²²²²²²²²²²²²²²̘òò̘ò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094òòòļǤòòòòòòŌ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽòòòò\u0094\u0094\u0094Ƽ\u0094\u0094\u0094Ƽ\u0094\u0094\u0094Ƽ\u0094\u0094\u0094ƼŎŎŎŎŎŎŎŎŎŎŎŎŎŎŎŎ\u0010̚̚\u0010ʐʒ̚\u0010\u0010\u0010\u0010̜\u0010Ȯ̚\u0010̚\u0012\u0012\u0012\u0012\u0010\u0010̞\u0010\u0010\u0010\u0010\u0010ʀòòŪŪŪŪŪŪŪŪŪŪŪŪŪ˼ŪŪŪŪŪŪŪŪŪŪŪŪòòòòòòŪŪŪŪŪŪŪŪŪŪŪòòòòòòòòòòòòòŪŪŪŪŪŪòò\n\u0010̢̠\u0012\u0012\u0012\u0012\u0012Ū\u0012\u0012\u0012\u0012̨̤̦̪̪̪̪îîǶ̬ââŪ̮̰̲Ū\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƼŌ̴̶Ȓ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094̲âȒòòƸ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094òƸ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽǰ̸̸ǰǰǰǰǰ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƼòòŪŪòòòòòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ǰǰǰǰǰǰǰǰǰǰǰǰǰǰˤǖ̺̺̺̺̺ǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰ̼̾ǂǂ̀͂͂͂͂͂PPǰǰǰǰǰǰǰǰǰǰǰǰǰǰŪ˦ǰǰǰǰǰǰǰǰ̈́PPPPPPPǰǰǰǰǰǰŪŪǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǺǰǰǰǰǰǰǰǰǰǰǰˤŪ˦ǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰŪǰǰǰǰǰǰǰǰǰǰǰǰǰǰǰˤ͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆òòòòò͈͆͆͆͆͆͆òòòòòòòòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ȴ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƼòŪŪŪŪŪŪŪŪŪŪŪǖòòòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094͊\u0010\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ǴǴǴǴǴ\u0094òòòòòòòòòò```````Ʋİ͌ŎŎŎŎî̞````````````òòòƺ\u0094\u0094\u0094͎͎͎͎͐îľľľòòòòäääääääääää͒ææææä```````\u0088```````````````ȼ\u0088\u0088\u0088df̌`````͔͖̌͘``òòòòòò`````͚òòòòòòòòòòòòòòòòòòòòòòÜ\u0090\u0094\u0094\u0094ƪ\u0094ƪ\u0094Ʋ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ǾƮƨŪŪòòǂǂǂǰ͜òòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0010\u0010òòòòƬ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƬƬƬƬƬƬƬƬƒòòòòľǪǪǪǪǪòòòîîîîîîîîî\u0094\u0094\u0094ľȠòòǴǴǴǴǴ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ŎŎƠîľ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ǈŎŎŎŎŎȂòòòòòņ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƲƬŎŎƬƨƬ͞ľľľľľľļǪǪǪǪǪòòľ\u0094\u0094\u0094\u0094ǈŎŎƨƮƨƮƦòòòò\u0094ǈ\u0094\u0094\u0094\u0094ƨòǪǪǪǪǪòľľ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ȓ\u0094\u0094ǮǰȊòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ǎŎǎǈǎ\u0094\u0094ƠƲƼòòòòòòòòòòòƸȴľ\u0094\u0094\u0094\u0094\u0094ǾŎƬľȴ͠ƒòòòòƸ\u0094\u0094ƼƸ\u0094\u0094ƼƸ\u0094\u0094Ƽòòòò\u0094\u0094\u0094Ƽ\u0094\u0094\u0094Ƽòòòòòòòò\u0094ǾƮƬƨ͢ȈòǪǪǪǪǪòòò\u0094\u0094òòòòòò\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094ƼòƸ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094òòͤͤͤͤͤͤͤͤͤͤͤͤͤͤͤͤͦͦͦͦͦͦͦͦͦͦͦͦͦͦͦͦ͆͆͆͆͆ͨ͆͆͆ͪ͆͆ͬ͆͆͆͆͆͆͆͆͆͆͆͆ͮ͆͆͆͆͆͆͆͆͆͆͆͆͆͆ͰͲ͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆ʹ͆͆͆͆͆͆͆͆ò͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆͆òòò²²²ɜòòòòò̘²²òòͶ\u0378ŖŖŖŖͺŖŖŖŖŖŖŘŖŖŘŘŖͶŘŖŖŖŖŖŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰͼͼͼͼͼͼͼͼòòòòòòòòƔŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰ;òòòòòòòòŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰòŰŰŰŰŰŰŰŰŰŰŰòòòòòòòòòòòòòòòòòòòòŰŰŰŰŰŰ\u0380òîîîîîîîî\u0010\u0010\u0010\u0382΄òòòîîîƒòòòò̜ΆΈΊΊΊΊΊΊΊ΄\u0382΄\u0010ʔΌ\u001cΎΐ\u0010Β̆̆Δ\u0010Ζ˜̈ΘʎòòŰŰƤŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰŰƤΚ̔\f\u000e\u0010\u0012\u0014\u0016\u0018\u001a\u001a\u001a\u001a\u001a\u001c\u001e ,............02ʦʚ\u0012\u0010\u0094\u0094\u0094\u0094\u0094Ȓ\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094â\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094\u0094Ƽò\u0094\u0094\u0094ò\u0094\u0094\u0094ò\u0094\u0094\u0094ò\u0094Ƽò:Μǔʮ˄Ţ˘ǖòòòòΞΠŪò".toCharArray();
   static final int[] A = new int[930];
   static final String A_DATA = "䠀ဏ䠀ဏ䠀ဏ堀䀏倀䀏堀䀏怀䀏倀䀏倀䀏倀䀏怀䀌栀\u0018栀\u0018⠀\u0018⠀怚⠀\u0018栀\u0018栀\u0018\ue800\u0015\ue800\u0016栀\u0018 \u0019㠀\u0018 \u0014㠀\u0018㠀\u0018᠀㘉᠀㘉㠀\u0018栀\u0018\ue800\u0019栀\u0019\ue800\u0019栀\u0018栀\u0018\u0082翡\u0082翡\u0082翡\u0082翡\ue800\u0015栀\u0018\ue800\u0016栀\u001b栀倗栀\u001b\u0081翢\u0081翢\u0081翢\u0081翢\ue800\u0015栀\u0019\ue800\u0016栀\u0019䠀ဏ䠀ဏ倀ဏ㠀\f栀\u0018⠀怚⠀怚栀\u001c栀\u0018栀\u001b栀\u001c\u0000瀅\ue800\u001d栀\u0019䠀တ栀\u001c栀\u001b⠀\u001c⠀\u0019᠀؋᠀؋栀\u001b\u07fd瀂栀\u001b᠀ԋ\u0000瀅\ue800\u001e栀ࠋ栀ࠋ栀ࠋ栀\u0018\u0082瀁\u0082瀁\u0082瀁栀\u0019\u0082瀁\u07fd瀂\u0081瀂\u0081瀂\u0081瀂栀\u0019\u0081瀂\u061d瀂\u0006瀁\u0005瀂\u07ff\uf001Ρ瀂\u0000瀂\u0006瀁\u0005瀂\u0006瀁\u0005瀂\u07fd瀂؞瀁\u0006瀁ӵ瀂͊瀁̺瀁\u0006瀁\u0005瀂̶瀁̶瀁\u0006瀁\u0005瀂\u0000瀂ľ瀁̪瀁̮瀁\u0006瀁̾瀁ٽ瀂͎瀁͆瀁յ瀂\u0000瀂͎瀁͖瀁\u05f9瀂͚瀁ͪ瀁\u0006瀁\u0005瀂ͪ瀁\u0000瀂\u0000瀂\u0005瀂ͦ瀁ͦ瀁\u0006瀁\u0005瀂ͮ瀁\u0000瀂\u0000瀅\u0000瀂ܡ瀂\u0000瀅\u0000瀅\n\uf001\u0007\uf003\t\uf002\n\uf001\u0007\uf003\t\uf002\t\uf002\u0006瀁\u0005瀂Ľ瀂\u07fd瀂\n\uf001پ瀁ܢ瀁\u05fa瀁\u0000瀂\u07fe瀁\u0006瀁\u0005瀂ն瀁\u07fe瀁\u07fd瀂\u07fd瀂\u0006瀁\u0005瀂Ӷ瀁Ė瀁Ğ瀁\u07fd瀂\u07fd瀂\u07fd瀂͉瀂̹瀂\u0000瀂̵瀂̵瀂\u0000瀂̩瀂\u0000瀂̭瀂̵瀂\u0000瀂\u0000瀂̽瀂\u0000瀂\u07fd瀂\u07fd瀂\u0000瀂ͅ瀂͍瀂\u0000瀂͍瀂͕瀂\u0000瀂\u0000瀂͙瀂ͩ瀂\u0000瀂\u0000瀂ͩ瀂ͩ瀂ĕ瀂ͥ瀂ͥ瀂ĝ瀂\u0000瀂ͭ瀂\u0000瀂\u0000瀅\u0000瀂\u0000瀄\u0000瀄\u0000瀄栀瀄栀瀄\u0000瀄\u0000瀄\u0000瀄栀\u001b栀\u001b栀瀄栀瀄\u0000瀄栀\u001b栀瀄栀\u001b\u0000瀄栀\u001b䀀〆䀀〆䀀〆䚱〆砀\u0000砀\u0000\u0000瀄\u05f9瀂\u05f9瀂\u05f9瀂栀\u0018砀\u0000\u009a瀁栀\u0018\u0096瀁\u0096瀁\u0096瀁砀\u0000Ă瀁砀\u0000þ瀁þ瀁\u07fd瀂\u0082瀁砀\u0000\u0082瀁\u0099瀂\u0095瀂\u0095瀂\u0095瀂\u07fd瀂\u0081瀂}瀂\u0081瀂ā瀂ý瀂ý瀂\"瀁ù瀂å瀂\u0000瀁\u0000瀁\u0000瀁½瀂Ù瀂!瀂ř瀂Ł瀂ߥ瀂\u0000瀂ܒ瀁Ɓ瀂栀\u0019\u0006瀁\u0005瀂ߦ瀁\u0000瀂\u05fa瀁\u05fa瀁\u05fa瀁ł瀁ł瀁Ł瀂Ł瀂\u0000\u001c䀀〆䀀\u0007䀀\u0007>瀁\u0006瀁\u0005瀂=瀂砀\u0000Â瀁Â瀁Â瀁Â瀁砀\u0000砀\u0000\u0000瀄\u0000\u0018\u0000\u0018砀\u0000Á瀂Á瀂Á瀂Á瀂\u07fd瀂砀\u0000\u0000\u0018栀\u0014砀\u0000砀\u0000⠀怚砀\u0000䀀〆䀀〆䀀〆ࠀ\u0014䀀〆ࠀ\u0018䀀〆䀀〆ࠀ\u0018ࠀ瀅ࠀ瀅ࠀ瀅砀\u0000ࠀ瀅ࠀ\u0018ࠀ\u0018砀\u0000　တ　တ　တ砀\u0000栀\u0019栀\u0019က\u0019⠀\u0018⠀\u0018က怚㠀\u0018က\u0018栀\u001c栀\u001c䀀〆က\u0018က\u0018က\u0018က瀅က瀅က瀄က瀅က瀅䀀〆䀀〆䀀〆　㐉　㐉⠀\u0018　\u0018　\u0018က\u0018䀀〆က瀅က\u0018က瀅䀀〆　တ栀\u001c䀀〆䀀〆က瀄က瀄䀀〆䀀〆栀\u001cက瀅က\u001cက\u001cက瀅砀\u0000ကတ䀀〆砀\u0000砀\u0000က瀅ࠀ㐉ࠀ㐉ࠀ瀅䀀〆ࠀ瀄ࠀ瀄ࠀ瀄砀\u0000ࠀ瀄䀀〆䀀〆䀀〆ࠀ\u0018ࠀ\u0018က瀅砀\u0000䀀〆砀\u0000䀀〆\u0000〈䀀〆\u0000瀅\u0000〈\u0000〈\u0000〈䀀〆\u0000〈䀀〆\u0000瀅䀀〆\u0000㝉\u0000㝉\u0000\u0018\u0000瀄砀\u0000\u0000瀅砀\u0000䀀〆\u0000瀅砀\u0000砀\u0000\u0000〈\u0000〈砀\u0000\u0000ࠋ\u0000ࠋ\u0000ࠋ\u0000۫\u0000\u001c⠀怚\u0000瀅䀀〆\u0000\u0018⠀怚\u0000\u001c\u0000瀅䀀〆\u0000瀅\u0000\u074b\u0000ࠋ\u0000ࠋ栀\u001c栀\u001c⠀怚栀\u001c砀\u0000栀ԋ栀ԋ栀ҫ栀ҫ栀ҫ\u0000\u001c\u0000〈\u0000〆\u0000〆\u0000〈砀\u0000\u0000\u001c\u0000\u0018砀\u0000\u0000瀄䀀〆䀀〆\u0000\u0018\u0000㘉\u0000㘉\u0000瀄砀\u0000\u0000瀅\u0000\u001c\u0000\u001c\u0000\u001c\u0000\u0018\u0000\u001c\u0000㐉\u0000㐉\u0000〈\u0000〈䀀〆\u0000\u001c\u0000\u001c砀\u0000\u0000\u001c\u0000\u0018\u0000瀅\u0000〈䀀〆\u0000〈\u0000〈\u0000〈\u0000〈\u0000瀅䀀〆\u0000〈\u0000〈䀀〆\u0000瀅\u0000〈\u07fe瀁\u07fe瀁砀\u0000\u07fe瀁\u0000瀅\u0000\u0018\u0000瀄\u0000瀅\u0000\u0018\u0000܋\u0000܋\u0000܋\u0000܋\u0000Ы\u0000Ջ\u0000ࠋ\u0000ࠋ砀\u0000栀\u0014\u0000瀅\u0000\u0018\u0000瀅怀䀌\u0000瀅\u0000瀅\ue800\u0015\ue800\u0016砀\u0000\u0000瑪\u0000瑪\u0000瑪砀\u0000栀؋栀؋栀\u0014栀\u0018栀\u0018䀀〆怀䀌砀\u0000\u0000瀅\u0000瀄\u0000〈\u0000瀅\u0000ӫ砀\u0000䀀〆\u0000〈\u0000瀄\u0000瀂\u0000瀄\u07fd瀂\u0000瀂\u0000瀄\u07fd瀂í瀂\u07fe瀁\u0000瀂ߡ瀂ߡ瀂ߢ瀁ߢ瀁\u07fd瀂ߡ瀂砀\u0000ߢ瀁ۙ瀂ۙ瀂ک瀂ک瀂ٱ瀂ٱ瀂\u0601瀂\u0601瀂ف瀂ف瀂؉瀂؉瀂\u07ff\uf003\u07ff\uf003\u07fd瀂砀\u0000ۚ瀁ۚ瀁\u07ff\uf003栀\u001b\u07fd瀂栀\u001bڪ瀁ڪ瀁ٲ瀁ٲ瀁砀\u0000栀\u001b\u07fd瀂ߥ瀂ق瀁ق瀁ߦ瀁栀\u001b\u0602瀁\u0602瀁؊瀁؊瀁栀\u001b砀\u0000怀䀌怀䀌怀䀌怀\f怀䀌䠀တ䠀တ䠀တ\u0000တࠀတ栀\u0014栀\u0014栀\u001d栀\u001e栀\u0015栀\u001d怀䀍倀䀎砀တ砀တ砀တ㠀\f⠀\u0018⠀\u0018⠀\u0018栀\u0018栀\u0018\ue800\u001d\ue800\u001e栀\u0018栀\u0018栀倗栀倗栀\u0018㠀\u0019\ue800\u0015\ue800\u0016栀\u0018栀\u0019栀\u0018栀\u0018怀䀌䠀တ砀\u0000᠀؋\u0000瀄 \u0019 \u0019栀\u0019\ue800\u0015\ue800\u0016\u0000瀄᠀Ћ᠀Ћ\u0000瀄砀\u0000⠀怚砀\u0000䀀〆䀀\u0007䀀\u0007䀀〆\u0000瀁栀\u001c栀\u001c\u0000瀁\u0000瀂\u0000瀁\u0000瀁\u0000瀂栀\u0019\u0000瀁\u07fe瀁栀\u001c⠀\u001c\u0000瀂r瀁\u0000瀁栀\u001c栀\u0019q瀂\u0000\u001cB琪B琪B砊B砊A瘪A瘪A砊A砊\u0000砊\u0000砊\u0000砊\u0006瀁\u0005瀂\u0000琪\u0000砊栀۫栀\u0019栀\u001c栀\u0019\ue800\u0019\ue800\u0019\ue800\u0019 \u0019⠀\u0019栀\u001c\ue800\u0015\ue800\u0016栀\u001c\u0000\u001c栀\u001c栀\u001c\u0000\u001c栀Ы栀Ы栀֫栀֫᠀ܫ᠀ܫj\u001cj\u001ci\u001ci\u001c栀ۋ栀Ћ栀Ћ栀Ћ栀Ћ栀\u058b栀\u058b栀\u058b栀\u058b栀Ы砀\u0000栀\u001c栀ի栀ի栀۫栀۫\ue800\u0019\ue800\u0015\ue800\u0016栀\u0019\ue800\u0016\ue800\u0015栀\u0019砀\u0000Á瀂砀\u0000\u0005瀂\u07fe瀁\u0000瀂栀\u001c栀\u001c\u0006瀁\u0005瀂䀀〆砀\u0000栀\u0018栀\u0018栀ࠋ砀\u0000\u07fd瀂\ue800\u001d\ue800\u001e栀\u0018栀\u0014栀\u0018栀瀄栀\u001c\u0000瀄\u0000瀅\u0000眪栀\u0014栀\u0015栀\u0016栀\u0016栀\u001c\u0000琊\u0000琊\u0000琊栀\u0014\u0000瀄\u0000癊\u0000睪\u0000璊\u0000瀄\u0000瀅栀\u0018䀀〆栀\u001b栀\u001b\u0000瀄\u0000\u05eb\u0000\u05eb\u0000Ы\u0000Ы\u0000ы\u0000ի\u0000ڋ\u0000ࠋ栀\u001c栀ҋ栀ҋ栀ҋ\u0000\u001c栀ࠋ\u0000瀅\u0000瀅\u0000瀅砀\u0000\u0000瀄栀\u0018䀀\u0007栀\u0018\u0000睪\u0000睪\u0000睪\u0000瘪栀\u001b栀瀄栀瀄\u0000\u001b\u0000\u001b\u0006瀁\u0000瀂砀\u0000\u07fe瀁砀\u0000⠀怚⠀\u001c\u0000〈\u0000\u0018\u0000瀄\u0000〈\u0000〈\u0000\u0018\u0000\u0013\u0000\u0013\u0000\u0012\u0000\u0012\u0000瀅\u0000眅\u0000瀅\u0000盥\u0000畅\u0000瀅\u0000病\u0000瀅\u0000瀅\u0000皥\u0000瀅\u0000癥\u0000瀅\u0000疥砀\u0000ࠀ瀅䀀〆ࠀ瀅ࠀ瀅 \u0019က\u001bက\u001b栀\u0015栀\u0016က怚栀\u001c栀\u0018栀\u0015栀\u0016栀\u0018栀\u0014栀倗栀倗栀\u0015栀\u0016栀\u0015栀倗栀倗㠀\u0018砀\u0000栀\u0018㠀\u0018栀\u0014\ue800\u0015\ue800\u0016⠀\u0018 \u0019 \u0014栀\u0018⠀怚砀\u0000䠀တ栀\u0019栀\u001b砀\u0000栀တ栀တ栀တ";
   static final char[] B = "\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0001\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0004\u0000\u0004\u0000\u0004\u0004\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0004\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0004\u0004\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0004\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0004\u0004\u0000\u0000\u0004\u0004\u0004\u0004\u0004\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0004\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0004\u0004\u0004\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0004\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0001\u0000\u0000\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0002\u0002\u0002\u0001\u0001\u0001\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0006\u0006\u0005\u0005\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0010\u0010\u0000\u0000\u0000\u0000\u0000\u0010\u0010\u0010\u0000\u0000\u0010\u0010\u0010\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0010\u0010\u0010\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0004\u0000\u0000\u0000\u0000\u0000\u0010\u0010\u0010\u0010\u0010\u0010\u0010\u0010\u0010\u0010\u0010\u0010\u0010\u0010\u0000\u0000\u0004\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000".toCharArray();

   int getProperties(int var1) {
      char var2 = (char)var1;
      int var3 = A[Y[X[var2 >> 5] | var2 >> 1 & 15] | var2 & 1];
      return var3;
   }

   int getPropertiesEx(int var1) {
      char var2 = (char)var1;
      char var3 = B[Y[X[var2 >> 5] | var2 >> 1 & 15] | var2 & 1];
      return var3;
   }

   int getType(int var1) {
      int var2 = this.getProperties(var1);
      return var2 & 31;
   }

   boolean isOtherLowercase(int var1) {
      int var2 = this.getPropertiesEx(var1);
      return (var2 & 1) != 0;
   }

   boolean isOtherUppercase(int var1) {
      int var2 = this.getPropertiesEx(var1);
      return (var2 & 2) != 0;
   }

   boolean isOtherAlphabetic(int var1) {
      int var2 = this.getPropertiesEx(var1);
      return (var2 & 4) != 0;
   }

   boolean isIdeographic(int var1) {
      int var2 = this.getPropertiesEx(var1);
      return (var2 & 16) != 0;
   }

   boolean isJavaIdentifierStart(int var1) {
      int var2 = this.getProperties(var1);
      return (var2 & 28672) >= 20480;
   }

   boolean isJavaIdentifierPart(int var1) {
      int var2 = this.getProperties(var1);
      return (var2 & 12288) != 0;
   }

   boolean isUnicodeIdentifierStart(int var1) {
      int var2 = this.getProperties(var1);
      return (var2 & 28672) == 28672;
   }

   boolean isUnicodeIdentifierPart(int var1) {
      int var2 = this.getProperties(var1);
      return (var2 & 4096) != 0;
   }

   boolean isIdentifierIgnorable(int var1) {
      int var2 = this.getProperties(var1);
      return (var2 & 28672) == 4096;
   }

   int toLowerCase(int var1) {
      int var2 = var1;
      int var3 = this.getProperties(var1);
      if ((var3 & 131072) != 0) {
         if ((var3 & 133955584) == 133955584) {
            switch(var1) {
            case 304:
               var2 = 105;
               break;
            case 570:
               var2 = 11365;
               break;
            case 574:
               var2 = 11366;
               break;
            case 4256:
               var2 = 11520;
               break;
            case 4257:
               var2 = 11521;
               break;
            case 4258:
               var2 = 11522;
               break;
            case 4259:
               var2 = 11523;
               break;
            case 4260:
               var2 = 11524;
               break;
            case 4261:
               var2 = 11525;
               break;
            case 4262:
               var2 = 11526;
               break;
            case 4263:
               var2 = 11527;
               break;
            case 4264:
               var2 = 11528;
               break;
            case 4265:
               var2 = 11529;
               break;
            case 4266:
               var2 = 11530;
               break;
            case 4267:
               var2 = 11531;
               break;
            case 4268:
               var2 = 11532;
               break;
            case 4269:
               var2 = 11533;
               break;
            case 4270:
               var2 = 11534;
               break;
            case 4271:
               var2 = 11535;
               break;
            case 4272:
               var2 = 11536;
               break;
            case 4273:
               var2 = 11537;
               break;
            case 4274:
               var2 = 11538;
               break;
            case 4275:
               var2 = 11539;
               break;
            case 4276:
               var2 = 11540;
               break;
            case 4277:
               var2 = 11541;
               break;
            case 4278:
               var2 = 11542;
               break;
            case 4279:
               var2 = 11543;
               break;
            case 4280:
               var2 = 11544;
               break;
            case 4281:
               var2 = 11545;
               break;
            case 4282:
               var2 = 11546;
               break;
            case 4283:
               var2 = 11547;
               break;
            case 4284:
               var2 = 11548;
               break;
            case 4285:
               var2 = 11549;
               break;
            case 4286:
               var2 = 11550;
               break;
            case 4287:
               var2 = 11551;
               break;
            case 4288:
               var2 = 11552;
               break;
            case 4289:
               var2 = 11553;
               break;
            case 4290:
               var2 = 11554;
               break;
            case 4291:
               var2 = 11555;
               break;
            case 4292:
               var2 = 11556;
               break;
            case 4293:
               var2 = 11557;
               break;
            case 4295:
               var2 = 11559;
               break;
            case 4301:
               var2 = 11565;
               break;
            case 7838:
               var2 = 223;
               break;
            case 8072:
               var2 = 8064;
               break;
            case 8073:
               var2 = 8065;
               break;
            case 8074:
               var2 = 8066;
               break;
            case 8075:
               var2 = 8067;
               break;
            case 8076:
               var2 = 8068;
               break;
            case 8077:
               var2 = 8069;
               break;
            case 8078:
               var2 = 8070;
               break;
            case 8079:
               var2 = 8071;
               break;
            case 8088:
               var2 = 8080;
               break;
            case 8089:
               var2 = 8081;
               break;
            case 8090:
               var2 = 8082;
               break;
            case 8091:
               var2 = 8083;
               break;
            case 8092:
               var2 = 8084;
               break;
            case 8093:
               var2 = 8085;
               break;
            case 8094:
               var2 = 8086;
               break;
            case 8095:
               var2 = 8087;
               break;
            case 8104:
               var2 = 8096;
               break;
            case 8105:
               var2 = 8097;
               break;
            case 8106:
               var2 = 8098;
               break;
            case 8107:
               var2 = 8099;
               break;
            case 8108:
               var2 = 8100;
               break;
            case 8109:
               var2 = 8101;
               break;
            case 8110:
               var2 = 8102;
               break;
            case 8111:
               var2 = 8103;
               break;
            case 8124:
               var2 = 8115;
               break;
            case 8140:
               var2 = 8131;
               break;
            case 8188:
               var2 = 8179;
               break;
            case 8486:
               var2 = 969;
               break;
            case 8490:
               var2 = 107;
               break;
            case 8491:
               var2 = 229;
               break;
            case 11362:
               var2 = 619;
               break;
            case 11363:
               var2 = 7549;
               break;
            case 11364:
               var2 = 637;
               break;
            case 11373:
               var2 = 593;
               break;
            case 11374:
               var2 = 625;
               break;
            case 11375:
               var2 = 592;
               break;
            case 11376:
               var2 = 594;
               break;
            case 11390:
               var2 = 575;
               break;
            case 11391:
               var2 = 576;
               break;
            case 42877:
               var2 = 7545;
               break;
            case 42893:
               var2 = 613;
               break;
            case 42922:
               var2 = 614;
            }
         } else {
            int var4 = var3 << 5 >> 23;
            var2 = var1 + var4;
         }
      }

      return var2;
   }

   int toUpperCase(int var1) {
      int var2 = var1;
      int var3 = this.getProperties(var1);
      if ((var3 & 65536) != 0) {
         if ((var3 & 133955584) == 133955584) {
            switch(var1) {
            case 181:
               var2 = 924;
               break;
            case 383:
               var2 = 83;
               break;
            case 575:
               var2 = 11390;
               break;
            case 576:
               var2 = 11391;
               break;
            case 592:
               var2 = 11375;
               break;
            case 593:
               var2 = 11373;
               break;
            case 594:
               var2 = 11376;
               break;
            case 613:
               var2 = 42893;
               break;
            case 614:
               var2 = 42922;
               break;
            case 619:
               var2 = 11362;
               break;
            case 625:
               var2 = 11374;
               break;
            case 637:
               var2 = 11364;
               break;
            case 7545:
               var2 = 42877;
               break;
            case 7549:
               var2 = 11363;
               break;
            case 8064:
               var2 = 8072;
               break;
            case 8065:
               var2 = 8073;
               break;
            case 8066:
               var2 = 8074;
               break;
            case 8067:
               var2 = 8075;
               break;
            case 8068:
               var2 = 8076;
               break;
            case 8069:
               var2 = 8077;
               break;
            case 8070:
               var2 = 8078;
               break;
            case 8071:
               var2 = 8079;
               break;
            case 8080:
               var2 = 8088;
               break;
            case 8081:
               var2 = 8089;
               break;
            case 8082:
               var2 = 8090;
               break;
            case 8083:
               var2 = 8091;
               break;
            case 8084:
               var2 = 8092;
               break;
            case 8085:
               var2 = 8093;
               break;
            case 8086:
               var2 = 8094;
               break;
            case 8087:
               var2 = 8095;
               break;
            case 8096:
               var2 = 8104;
               break;
            case 8097:
               var2 = 8105;
               break;
            case 8098:
               var2 = 8106;
               break;
            case 8099:
               var2 = 8107;
               break;
            case 8100:
               var2 = 8108;
               break;
            case 8101:
               var2 = 8109;
               break;
            case 8102:
               var2 = 8110;
               break;
            case 8103:
               var2 = 8111;
               break;
            case 8115:
               var2 = 8124;
               break;
            case 8126:
               var2 = 921;
               break;
            case 8131:
               var2 = 8140;
               break;
            case 8179:
               var2 = 8188;
               break;
            case 11365:
               var2 = 570;
               break;
            case 11366:
               var2 = 574;
               break;
            case 11520:
               var2 = 4256;
               break;
            case 11521:
               var2 = 4257;
               break;
            case 11522:
               var2 = 4258;
               break;
            case 11523:
               var2 = 4259;
               break;
            case 11524:
               var2 = 4260;
               break;
            case 11525:
               var2 = 4261;
               break;
            case 11526:
               var2 = 4262;
               break;
            case 11527:
               var2 = 4263;
               break;
            case 11528:
               var2 = 4264;
               break;
            case 11529:
               var2 = 4265;
               break;
            case 11530:
               var2 = 4266;
               break;
            case 11531:
               var2 = 4267;
               break;
            case 11532:
               var2 = 4268;
               break;
            case 11533:
               var2 = 4269;
               break;
            case 11534:
               var2 = 4270;
               break;
            case 11535:
               var2 = 4271;
               break;
            case 11536:
               var2 = 4272;
               break;
            case 11537:
               var2 = 4273;
               break;
            case 11538:
               var2 = 4274;
               break;
            case 11539:
               var2 = 4275;
               break;
            case 11540:
               var2 = 4276;
               break;
            case 11541:
               var2 = 4277;
               break;
            case 11542:
               var2 = 4278;
               break;
            case 11543:
               var2 = 4279;
               break;
            case 11544:
               var2 = 4280;
               break;
            case 11545:
               var2 = 4281;
               break;
            case 11546:
               var2 = 4282;
               break;
            case 11547:
               var2 = 4283;
               break;
            case 11548:
               var2 = 4284;
               break;
            case 11549:
               var2 = 4285;
               break;
            case 11550:
               var2 = 4286;
               break;
            case 11551:
               var2 = 4287;
               break;
            case 11552:
               var2 = 4288;
               break;
            case 11553:
               var2 = 4289;
               break;
            case 11554:
               var2 = 4290;
               break;
            case 11555:
               var2 = 4291;
               break;
            case 11556:
               var2 = 4292;
               break;
            case 11557:
               var2 = 4293;
               break;
            case 11559:
               var2 = 4295;
               break;
            case 11565:
               var2 = 4301;
            }
         } else {
            int var4 = var3 << 5 >> 23;
            var2 = var1 - var4;
         }
      }

      return var2;
   }

   int toTitleCase(int var1) {
      int var2 = var1;
      int var3 = this.getProperties(var1);
      if ((var3 & '耀') != 0) {
         if ((var3 & 65536) == 0) {
            var2 = var1 + 1;
         } else if ((var3 & 131072) == 0) {
            var2 = var1 - 1;
         }
      } else if ((var3 & 65536) != 0) {
         var2 = this.toUpperCase(var1);
      }

      return var2;
   }

   int digit(int var1, int var2) {
      int var3 = -1;
      if (var2 >= 2 && var2 <= 36) {
         int var4 = this.getProperties(var1);
         int var5 = var4 & 31;
         if (var5 == 9) {
            var3 = var1 + ((var4 & 992) >> 5) & 31;
         } else if ((var4 & 3072) == 3072) {
            var3 = (var1 + ((var4 & 992) >> 5) & 31) + 10;
         }
      }

      return var3 < var2 ? var3 : -1;
   }

   int getNumericValue(int var1) {
      int var2 = this.getProperties(var1);
      boolean var3 = true;
      int var4;
      switch(var2 & 3072) {
      case 0:
      default:
         var4 = -1;
         break;
      case 1024:
         var4 = var1 + ((var2 & 992) >> 5) & 31;
         break;
      case 2048:
         switch(var1) {
         case 3057:
            var4 = 100;
            return var4;
         case 3058:
            var4 = 1000;
            return var4;
         case 3441:
            var4 = 100;
            return var4;
         case 3442:
            var4 = 1000;
            return var4;
         case 4981:
            var4 = 40;
            return var4;
         case 4982:
            var4 = 50;
            return var4;
         case 4983:
            var4 = 60;
            return var4;
         case 4984:
            var4 = 70;
            return var4;
         case 4985:
            var4 = 80;
            return var4;
         case 4986:
            var4 = 90;
            return var4;
         case 4987:
            var4 = 100;
            return var4;
         case 4988:
            var4 = 10000;
            return var4;
         case 8543:
            var4 = 1;
            return var4;
         case 8556:
            var4 = 50;
            return var4;
         case 8557:
            var4 = 100;
            return var4;
         case 8558:
            var4 = 500;
            return var4;
         case 8559:
            var4 = 1000;
            return var4;
         case 8572:
            var4 = 50;
            return var4;
         case 8573:
            var4 = 100;
            return var4;
         case 8574:
            var4 = 500;
            return var4;
         case 8575:
            var4 = 1000;
            return var4;
         case 8576:
            var4 = 1000;
            return var4;
         case 8577:
            var4 = 5000;
            return var4;
         case 8578:
            var4 = 10000;
            return var4;
         case 8582:
            var4 = 50;
            return var4;
         case 8583:
            var4 = 50000;
            return var4;
         case 8584:
            var4 = 100000;
            return var4;
         case 12875:
            var4 = 40;
            return var4;
         case 12876:
            var4 = 50;
            return var4;
         case 12877:
            var4 = 60;
            return var4;
         case 12878:
            var4 = 70;
            return var4;
         case 12879:
            var4 = 80;
            return var4;
         case 12892:
            var4 = 32;
            return var4;
         case 12893:
            var4 = 33;
            return var4;
         case 12894:
            var4 = 34;
            return var4;
         case 12895:
            var4 = 35;
            return var4;
         case 12977:
            var4 = 36;
            return var4;
         case 12978:
            var4 = 37;
            return var4;
         case 12979:
            var4 = 38;
            return var4;
         case 12980:
            var4 = 39;
            return var4;
         case 12981:
            var4 = 40;
            return var4;
         case 12982:
            var4 = 41;
            return var4;
         case 12983:
            var4 = 42;
            return var4;
         case 12984:
            var4 = 43;
            return var4;
         case 12985:
            var4 = 44;
            return var4;
         case 12986:
            var4 = 45;
            return var4;
         case 12987:
            var4 = 46;
            return var4;
         case 12988:
            var4 = 47;
            return var4;
         case 12989:
            var4 = 48;
            return var4;
         case 12990:
            var4 = 49;
            return var4;
         case 12991:
            var4 = 50;
            return var4;
         default:
            var4 = -2;
            return var4;
         }
      case 3072:
         var4 = (var1 + ((var2 & 992) >> 5) & 31) + 10;
      }

      return var4;
   }

   boolean isWhitespace(int var1) {
      int var2 = this.getProperties(var1);
      return (var2 & 28672) == 16384;
   }

   byte getDirectionality(int var1) {
      int var2 = this.getProperties(var1);
      byte var3 = (byte)((var2 & 2013265920) >> 27);
      if (var3 == 15) {
         switch(var1) {
         case 8234:
            var3 = 14;
            break;
         case 8235:
            var3 = 16;
            break;
         case 8236:
            var3 = 18;
            break;
         case 8237:
            var3 = 15;
            break;
         case 8238:
            var3 = 17;
            break;
         default:
            var3 = -1;
         }
      }

      return var3;
   }

   boolean isMirrored(int var1) {
      int var2 = this.getProperties(var1);
      return (var2 & Integer.MIN_VALUE) != 0;
   }

   int toUpperCaseEx(int var1) {
      int var2 = var1;
      int var3 = this.getProperties(var1);
      if ((var3 & 65536) != 0) {
         if ((var3 & 133955584) != 133955584) {
            int var4 = var3 << 5 >> 23;
            var2 = var1 - var4;
         } else {
            switch(var1) {
            case 181:
               var2 = 924;
               break;
            case 383:
               var2 = 83;
               break;
            case 575:
               var2 = 11390;
               break;
            case 576:
               var2 = 11391;
               break;
            case 592:
               var2 = 11375;
               break;
            case 593:
               var2 = 11373;
               break;
            case 594:
               var2 = 11376;
               break;
            case 613:
               var2 = 42893;
               break;
            case 614:
               var2 = 42922;
               break;
            case 619:
               var2 = 11362;
               break;
            case 625:
               var2 = 11374;
               break;
            case 637:
               var2 = 11364;
               break;
            case 7545:
               var2 = 42877;
               break;
            case 7549:
               var2 = 11363;
               break;
            case 8126:
               var2 = 921;
               break;
            case 11365:
               var2 = 570;
               break;
            case 11366:
               var2 = 574;
               break;
            case 11520:
               var2 = 4256;
               break;
            case 11521:
               var2 = 4257;
               break;
            case 11522:
               var2 = 4258;
               break;
            case 11523:
               var2 = 4259;
               break;
            case 11524:
               var2 = 4260;
               break;
            case 11525:
               var2 = 4261;
               break;
            case 11526:
               var2 = 4262;
               break;
            case 11527:
               var2 = 4263;
               break;
            case 11528:
               var2 = 4264;
               break;
            case 11529:
               var2 = 4265;
               break;
            case 11530:
               var2 = 4266;
               break;
            case 11531:
               var2 = 4267;
               break;
            case 11532:
               var2 = 4268;
               break;
            case 11533:
               var2 = 4269;
               break;
            case 11534:
               var2 = 4270;
               break;
            case 11535:
               var2 = 4271;
               break;
            case 11536:
               var2 = 4272;
               break;
            case 11537:
               var2 = 4273;
               break;
            case 11538:
               var2 = 4274;
               break;
            case 11539:
               var2 = 4275;
               break;
            case 11540:
               var2 = 4276;
               break;
            case 11541:
               var2 = 4277;
               break;
            case 11542:
               var2 = 4278;
               break;
            case 11543:
               var2 = 4279;
               break;
            case 11544:
               var2 = 4280;
               break;
            case 11545:
               var2 = 4281;
               break;
            case 11546:
               var2 = 4282;
               break;
            case 11547:
               var2 = 4283;
               break;
            case 11548:
               var2 = 4284;
               break;
            case 11549:
               var2 = 4285;
               break;
            case 11550:
               var2 = 4286;
               break;
            case 11551:
               var2 = 4287;
               break;
            case 11552:
               var2 = 4288;
               break;
            case 11553:
               var2 = 4289;
               break;
            case 11554:
               var2 = 4290;
               break;
            case 11555:
               var2 = 4291;
               break;
            case 11556:
               var2 = 4292;
               break;
            case 11557:
               var2 = 4293;
               break;
            case 11559:
               var2 = 4295;
               break;
            case 11565:
               var2 = 4301;
               break;
            default:
               var2 = -1;
            }
         }
      }

      return var2;
   }

   char[] toUpperCaseCharArray(int var1) {
      char[] var2 = new char[]{(char)var1};
      int var3 = this.findInCharMap(var1);
      if (var3 != -1) {
         var2 = charMap[var3][1];
      }

      return var2;
   }

   int findInCharMap(int var1) {
      if (charMap != null && charMap.length != 0) {
         int var3 = 0;
         int var2 = charMap.length;

         int var4;
         for(var4 = var2 / 2; var2 - var3 > 1; var4 = (var2 + var3) / 2) {
            if (var1 >= charMap[var4][0][0]) {
               var3 = var4;
            } else {
               var2 = var4;
            }
         }

         if (var1 == charMap[var4][0][0]) {
            return var4;
         } else {
            return -1;
         }
      } else {
         return -1;
      }
   }

   private CharacterData00() {
   }

   static {
      char[] var0 = "䠀ဏ䠀ဏ䠀ဏ堀䀏倀䀏堀䀏怀䀏倀䀏倀䀏倀䀏怀䀌栀\u0018栀\u0018⠀\u0018⠀怚⠀\u0018栀\u0018栀\u0018\ue800\u0015\ue800\u0016栀\u0018 \u0019㠀\u0018 \u0014㠀\u0018㠀\u0018᠀㘉᠀㘉㠀\u0018栀\u0018\ue800\u0019栀\u0019\ue800\u0019栀\u0018栀\u0018\u0082翡\u0082翡\u0082翡\u0082翡\ue800\u0015栀\u0018\ue800\u0016栀\u001b栀倗栀\u001b\u0081翢\u0081翢\u0081翢\u0081翢\ue800\u0015栀\u0019\ue800\u0016栀\u0019䠀ဏ䠀ဏ倀ဏ㠀\f栀\u0018⠀怚⠀怚栀\u001c栀\u0018栀\u001b栀\u001c\u0000瀅\ue800\u001d栀\u0019䠀တ栀\u001c栀\u001b⠀\u001c⠀\u0019᠀؋᠀؋栀\u001b\u07fd瀂栀\u001b᠀ԋ\u0000瀅\ue800\u001e栀ࠋ栀ࠋ栀ࠋ栀\u0018\u0082瀁\u0082瀁\u0082瀁栀\u0019\u0082瀁\u07fd瀂\u0081瀂\u0081瀂\u0081瀂栀\u0019\u0081瀂\u061d瀂\u0006瀁\u0005瀂\u07ff\uf001Ρ瀂\u0000瀂\u0006瀁\u0005瀂\u0006瀁\u0005瀂\u07fd瀂؞瀁\u0006瀁ӵ瀂͊瀁̺瀁\u0006瀁\u0005瀂̶瀁̶瀁\u0006瀁\u0005瀂\u0000瀂ľ瀁̪瀁̮瀁\u0006瀁̾瀁ٽ瀂͎瀁͆瀁յ瀂\u0000瀂͎瀁͖瀁\u05f9瀂͚瀁ͪ瀁\u0006瀁\u0005瀂ͪ瀁\u0000瀂\u0000瀂\u0005瀂ͦ瀁ͦ瀁\u0006瀁\u0005瀂ͮ瀁\u0000瀂\u0000瀅\u0000瀂ܡ瀂\u0000瀅\u0000瀅\n\uf001\u0007\uf003\t\uf002\n\uf001\u0007\uf003\t\uf002\t\uf002\u0006瀁\u0005瀂Ľ瀂\u07fd瀂\n\uf001پ瀁ܢ瀁\u05fa瀁\u0000瀂\u07fe瀁\u0006瀁\u0005瀂ն瀁\u07fe瀁\u07fd瀂\u07fd瀂\u0006瀁\u0005瀂Ӷ瀁Ė瀁Ğ瀁\u07fd瀂\u07fd瀂\u07fd瀂͉瀂̹瀂\u0000瀂̵瀂̵瀂\u0000瀂̩瀂\u0000瀂̭瀂̵瀂\u0000瀂\u0000瀂̽瀂\u0000瀂\u07fd瀂\u07fd瀂\u0000瀂ͅ瀂͍瀂\u0000瀂͍瀂͕瀂\u0000瀂\u0000瀂͙瀂ͩ瀂\u0000瀂\u0000瀂ͩ瀂ͩ瀂ĕ瀂ͥ瀂ͥ瀂ĝ瀂\u0000瀂ͭ瀂\u0000瀂\u0000瀅\u0000瀂\u0000瀄\u0000瀄\u0000瀄栀瀄栀瀄\u0000瀄\u0000瀄\u0000瀄栀\u001b栀\u001b栀瀄栀瀄\u0000瀄栀\u001b栀瀄栀\u001b\u0000瀄栀\u001b䀀〆䀀〆䀀〆䚱〆砀\u0000砀\u0000\u0000瀄\u05f9瀂\u05f9瀂\u05f9瀂栀\u0018砀\u0000\u009a瀁栀\u0018\u0096瀁\u0096瀁\u0096瀁砀\u0000Ă瀁砀\u0000þ瀁þ瀁\u07fd瀂\u0082瀁砀\u0000\u0082瀁\u0099瀂\u0095瀂\u0095瀂\u0095瀂\u07fd瀂\u0081瀂}瀂\u0081瀂ā瀂ý瀂ý瀂\"瀁ù瀂å瀂\u0000瀁\u0000瀁\u0000瀁½瀂Ù瀂!瀂ř瀂Ł瀂ߥ瀂\u0000瀂ܒ瀁Ɓ瀂栀\u0019\u0006瀁\u0005瀂ߦ瀁\u0000瀂\u05fa瀁\u05fa瀁\u05fa瀁ł瀁ł瀁Ł瀂Ł瀂\u0000\u001c䀀〆䀀\u0007䀀\u0007>瀁\u0006瀁\u0005瀂=瀂砀\u0000Â瀁Â瀁Â瀁Â瀁砀\u0000砀\u0000\u0000瀄\u0000\u0018\u0000\u0018砀\u0000Á瀂Á瀂Á瀂Á瀂\u07fd瀂砀\u0000\u0000\u0018栀\u0014砀\u0000砀\u0000⠀怚砀\u0000䀀〆䀀〆䀀〆ࠀ\u0014䀀〆ࠀ\u0018䀀〆䀀〆ࠀ\u0018ࠀ瀅ࠀ瀅ࠀ瀅砀\u0000ࠀ瀅ࠀ\u0018ࠀ\u0018砀\u0000　တ　တ　တ砀\u0000栀\u0019栀\u0019က\u0019⠀\u0018⠀\u0018က怚㠀\u0018က\u0018栀\u001c栀\u001c䀀〆က\u0018က\u0018က\u0018က瀅က瀅က瀄က瀅က瀅䀀〆䀀〆䀀〆　㐉　㐉⠀\u0018　\u0018　\u0018က\u0018䀀〆က瀅က\u0018က瀅䀀〆　တ栀\u001c䀀〆䀀〆က瀄က瀄䀀〆䀀〆栀\u001cက瀅က\u001cက\u001cက瀅砀\u0000ကတ䀀〆砀\u0000砀\u0000က瀅ࠀ㐉ࠀ㐉ࠀ瀅䀀〆ࠀ瀄ࠀ瀄ࠀ瀄砀\u0000ࠀ瀄䀀〆䀀〆䀀〆ࠀ\u0018ࠀ\u0018က瀅砀\u0000䀀〆砀\u0000䀀〆\u0000〈䀀〆\u0000瀅\u0000〈\u0000〈\u0000〈䀀〆\u0000〈䀀〆\u0000瀅䀀〆\u0000㝉\u0000㝉\u0000\u0018\u0000瀄砀\u0000\u0000瀅砀\u0000䀀〆\u0000瀅砀\u0000砀\u0000\u0000〈\u0000〈砀\u0000\u0000ࠋ\u0000ࠋ\u0000ࠋ\u0000۫\u0000\u001c⠀怚\u0000瀅䀀〆\u0000\u0018⠀怚\u0000\u001c\u0000瀅䀀〆\u0000瀅\u0000\u074b\u0000ࠋ\u0000ࠋ栀\u001c栀\u001c⠀怚栀\u001c砀\u0000栀ԋ栀ԋ栀ҫ栀ҫ栀ҫ\u0000\u001c\u0000〈\u0000〆\u0000〆\u0000〈砀\u0000\u0000\u001c\u0000\u0018砀\u0000\u0000瀄䀀〆䀀〆\u0000\u0018\u0000㘉\u0000㘉\u0000瀄砀\u0000\u0000瀅\u0000\u001c\u0000\u001c\u0000\u001c\u0000\u0018\u0000\u001c\u0000㐉\u0000㐉\u0000〈\u0000〈䀀〆\u0000\u001c\u0000\u001c砀\u0000\u0000\u001c\u0000\u0018\u0000瀅\u0000〈䀀〆\u0000〈\u0000〈\u0000〈\u0000〈\u0000瀅䀀〆\u0000〈\u0000〈䀀〆\u0000瀅\u0000〈\u07fe瀁\u07fe瀁砀\u0000\u07fe瀁\u0000瀅\u0000\u0018\u0000瀄\u0000瀅\u0000\u0018\u0000܋\u0000܋\u0000܋\u0000܋\u0000Ы\u0000Ջ\u0000ࠋ\u0000ࠋ砀\u0000栀\u0014\u0000瀅\u0000\u0018\u0000瀅怀䀌\u0000瀅\u0000瀅\ue800\u0015\ue800\u0016砀\u0000\u0000瑪\u0000瑪\u0000瑪砀\u0000栀؋栀؋栀\u0014栀\u0018栀\u0018䀀〆怀䀌砀\u0000\u0000瀅\u0000瀄\u0000〈\u0000瀅\u0000ӫ砀\u0000䀀〆\u0000〈\u0000瀄\u0000瀂\u0000瀄\u07fd瀂\u0000瀂\u0000瀄\u07fd瀂í瀂\u07fe瀁\u0000瀂ߡ瀂ߡ瀂ߢ瀁ߢ瀁\u07fd瀂ߡ瀂砀\u0000ߢ瀁ۙ瀂ۙ瀂ک瀂ک瀂ٱ瀂ٱ瀂\u0601瀂\u0601瀂ف瀂ف瀂؉瀂؉瀂\u07ff\uf003\u07ff\uf003\u07fd瀂砀\u0000ۚ瀁ۚ瀁\u07ff\uf003栀\u001b\u07fd瀂栀\u001bڪ瀁ڪ瀁ٲ瀁ٲ瀁砀\u0000栀\u001b\u07fd瀂ߥ瀂ق瀁ق瀁ߦ瀁栀\u001b\u0602瀁\u0602瀁؊瀁؊瀁栀\u001b砀\u0000怀䀌怀䀌怀䀌怀\f怀䀌䠀တ䠀တ䠀တ\u0000တࠀတ栀\u0014栀\u0014栀\u001d栀\u001e栀\u0015栀\u001d怀䀍倀䀎砀တ砀တ砀တ㠀\f⠀\u0018⠀\u0018⠀\u0018栀\u0018栀\u0018\ue800\u001d\ue800\u001e栀\u0018栀\u0018栀倗栀倗栀\u0018㠀\u0019\ue800\u0015\ue800\u0016栀\u0018栀\u0019栀\u0018栀\u0018怀䀌䠀တ砀\u0000᠀؋\u0000瀄 \u0019 \u0019栀\u0019\ue800\u0015\ue800\u0016\u0000瀄᠀Ћ᠀Ћ\u0000瀄砀\u0000⠀怚砀\u0000䀀〆䀀\u0007䀀\u0007䀀〆\u0000瀁栀\u001c栀\u001c\u0000瀁\u0000瀂\u0000瀁\u0000瀁\u0000瀂栀\u0019\u0000瀁\u07fe瀁栀\u001c⠀\u001c\u0000瀂r瀁\u0000瀁栀\u001c栀\u0019q瀂\u0000\u001cB琪B琪B砊B砊A瘪A瘪A砊A砊\u0000砊\u0000砊\u0000砊\u0006瀁\u0005瀂\u0000琪\u0000砊栀۫栀\u0019栀\u001c栀\u0019\ue800\u0019\ue800\u0019\ue800\u0019 \u0019⠀\u0019栀\u001c\ue800\u0015\ue800\u0016栀\u001c\u0000\u001c栀\u001c栀\u001c\u0000\u001c栀Ы栀Ы栀֫栀֫᠀ܫ᠀ܫj\u001cj\u001ci\u001ci\u001c栀ۋ栀Ћ栀Ћ栀Ћ栀Ћ栀\u058b栀\u058b栀\u058b栀\u058b栀Ы砀\u0000栀\u001c栀ի栀ի栀۫栀۫\ue800\u0019\ue800\u0015\ue800\u0016栀\u0019\ue800\u0016\ue800\u0015栀\u0019砀\u0000Á瀂砀\u0000\u0005瀂\u07fe瀁\u0000瀂栀\u001c栀\u001c\u0006瀁\u0005瀂䀀〆砀\u0000栀\u0018栀\u0018栀ࠋ砀\u0000\u07fd瀂\ue800\u001d\ue800\u001e栀\u0018栀\u0014栀\u0018栀瀄栀\u001c\u0000瀄\u0000瀅\u0000眪栀\u0014栀\u0015栀\u0016栀\u0016栀\u001c\u0000琊\u0000琊\u0000琊栀\u0014\u0000瀄\u0000癊\u0000睪\u0000璊\u0000瀄\u0000瀅栀\u0018䀀〆栀\u001b栀\u001b\u0000瀄\u0000\u05eb\u0000\u05eb\u0000Ы\u0000Ы\u0000ы\u0000ի\u0000ڋ\u0000ࠋ栀\u001c栀ҋ栀ҋ栀ҋ\u0000\u001c栀ࠋ\u0000瀅\u0000瀅\u0000瀅砀\u0000\u0000瀄栀\u0018䀀\u0007栀\u0018\u0000睪\u0000睪\u0000睪\u0000瘪栀\u001b栀瀄栀瀄\u0000\u001b\u0000\u001b\u0006瀁\u0000瀂砀\u0000\u07fe瀁砀\u0000⠀怚⠀\u001c\u0000〈\u0000\u0018\u0000瀄\u0000〈\u0000〈\u0000\u0018\u0000\u0013\u0000\u0013\u0000\u0012\u0000\u0012\u0000瀅\u0000眅\u0000瀅\u0000盥\u0000畅\u0000瀅\u0000病\u0000瀅\u0000瀅\u0000皥\u0000瀅\u0000癥\u0000瀅\u0000疥砀\u0000ࠀ瀅䀀〆ࠀ瀅ࠀ瀅 \u0019က\u001bက\u001b栀\u0015栀\u0016က怚栀\u001c栀\u0018栀\u0015栀\u0016栀\u0018栀\u0014栀倗栀倗栀\u0015栀\u0016栀\u0015栀倗栀倗㠀\u0018砀\u0000栀\u0018㠀\u0018栀\u0014\ue800\u0015\ue800\u0016⠀\u0018 \u0019 \u0014栀\u0018⠀怚砀\u0000䠀တ栀\u0019栀\u001b砀\u0000栀တ栀တ栀တ".toCharArray();

      assert var0.length == 1860;

      int var1 = 0;

      int var3;
      for(int var2 = 0; var1 < 1860; A[var2++] = var3 | var0[var1++]) {
         var3 = var0[var1++] << 16;
      }

   }
}
